import type { TaskMessage } from '../../types/message'

export const MOCK_TASK_MESSAGES: Record<number, TaskMessage[]> = {
  1: [
    {
      id: 1,
      userId: 1,
      fullName: 'חנן בן ארי',
      upn: 'm8456329',
      emailDisplayName: 'פד"ם/עוצבת התקשוב/סגן מקשא"פ במיל\' - ס.ב.',
      timestamp: new Date('2026-03-23T15:25:00'),
      text: 'לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית קונסקטורר אדיפיסינג אלית. סת אלמנקום ניסי נון ניבאה. דס איאקוליס וולופטה דיאם. וסטיבולום אט דולור, קראס אגת לקטוס וואל אאוגו וסטיבולום סוליסי טידום בעליק. קונדימנטום קורוס בליקרה.',
    },
    {
      id: 2,
      userId: 3,
      fullName: 'יהודה לוי',
      upn: 's8456329',
      emailDisplayName: 'פד"ם/מטה מקשא"פ/ק.אג"מ - ס.ב.',
      timestamp: new Date('2026-03-23T16:14:00'),
      text: 'בוצעה העברת החומרים לאוגדה וחסר לעשות את הרישום.',
    },
    {
      id: 3,
      userId: 2,
      fullName: 'רבקה בר נתן',
      upn: 's6478559',
      emailDisplayName: 'פד"ם/תקשוב/מטה מקשא"פ/פקל"שית - ס.ב.',
      timestamp: new Date('2026-03-23T16:42:00'),
      text: 'שמירה על מסגרת שגרה ונהלים צבאים',
    },
    {
      id: 4,
      userId: 1,
      fullName: 'חנן בן ארי',
      upn: 'm8456329',
      emailDisplayName: 'פד"ם/עוצבת התקשוב/סגן מקשא"פ במיל\' - ס.ב.',
      timestamp: new Date('2026-05-15T10:38:00'),
      text: 'קינץ תתיח לרעח. לת צשחמי לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית. סת אלמנקום ניסי נון ניבאה.',
    },
  ],
}
